/**
 * \mainpage
 * Програма "Калькулятор" призначення для проведення основних операцій над дійсними числами. Сюди включені основні арифметичні
 * та тригонометричні дії.
 */


/**
 * Клас Manager - це об'єкт-обгортка над іншими об'єктами програми. Він призначений для створення інших об'єктів програми,
 * які мають виконувати основні задачі калькулятора. Об'єкт класу створюється при ініціалізації програми
 */
class Manager
{
 public:
 /**
  * Об'єкт класу InputManager призначений для проведення валідації введених чисел та їх зберігання
  */
 InputManager calcManager;
 
/**
 * Об'єкт класу AlgebraicOperations призначений для виконання основних арифметичних операцій над числами, зокрема:
 * додавання, віднімання, множення, ділення, зміна знака, отримання модуля числа, його піднесення до квадрату та добування квадратного кореня.
 */
 AlgebraicOperations algebraicOperations;

 /**
  * Об'єкт класу NumPanel призначений для керування введенням чисел. Він здійснює додавання обраних чисел до поля для введення,
  *  які в подальшому використовуються іншими об'єктами
  */
 NumPanel nPanel;

 /**
  * Об'єкт класу TrigonometricOperations призначений для виконання основних тригонометричний операцій над дійсними числами, а саме:
  * отримання синуса, косинуса, тангенса та котангенса аргумента, а також переведення дійсного числа із градусів у радіани.
  */
 TrigonometricOperations trOperations;
};