/**
 * Клас NumPanel здійснює загальне керування додаванням дозволених символів до поля введення чисел
 */
class NumPanel
{
 public:
  /**
   * Здійснює додавання цифри у крайне праве положення
   * @param num число, яке буде додане до поля для введення
   */
  void addNum(int num)
  {
   Form1->Edit1->Text = Form1->Edit1->Text + IntToStr(num);
  }

  /**
   * Здійснює додавання коми як розділювача цілої та дробової частини. Робить кнопку для введення коми недоступною після першого використання
   * для забезпечення валідації числа
   */
  void addComma()
  {
   Form1->Edit1->Text = Form1->Edit1->Text + ',';
   Form1->comma_btn->Enabled = false;
  }
};
